## Scratch: app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 7 to change, 8 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.forms_secrets_manager will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "forms_secrets_manager"  {
      ~ id      = "1702814589" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:server-database-url-XPW7mO",
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:notify_api_key-gskHgv",
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM",
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1",
              - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM",
              ~ (known after apply),
              ~ (known after apply),
                # (2 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # data.aws_iam_policy_document.lambda_app_invoke will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_app_invoke"  {
      ~ id      = "3238720903" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:722713121070:function:Templates",
                          - "arn:aws:lambda:ca-central-1:722713121070:function:Submission",
                          - "arn:aws:lambda:ca-central-1:722713121070:function:Retrieval",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "form_viewer_task"  {
      ~ id       = "ee5dcc3d12cc0bff132e5058fc7e35ab15178df4f2593c6dadd94c9b86c835f6" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:722713121070:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:722713121070:function:Templates"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:722713121070:function:Organisations"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-scratch.cdssandbox.xyz"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.tdwryw.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-scratch-reliability-file-storage"
                        },
                    ]
                  - image            = "722713121070.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_scratch"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:notify_api_key-gskHgv"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:server-database-url-XPW7mO"
                        },
                    ]
                },
            ]
        ) -> (known after apply)
      ~ vars     = {
          ~ "google_client_id"         = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1" -> (known after apply)
          ~ "google_client_secret"     = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM" -> (known after apply)
            # (14 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:722713121070:task-definition/form-viewer:6" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-scratch.cdssandbox.xyz"
                        },
                      - {
                          - name  = "ORGANISATIONS_API"
                          - value = "arn:aws:lambda:ca-central-1:722713121070:function:Organisations"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.tdwryw.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-scratch-reliability-file-storage"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:722713121070:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATES_API"
                          - value = "arn:aws:lambda:ca-central-1:722713121070:function:Templates"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "722713121070.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_scratch"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:notify_api_key-gskHgv"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:server-database-url-XPW7mO"
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "forms_secrets_manager" {
        id        = "arn:aws:iam::722713121070:policy/formsSecretsManagerKeyRetrieval"
        name      = "formsSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:server-database-url-XPW7mO",
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:notify_api_key-gskHgv",
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM",
                          - "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_app_invoke will be updated in-place
  ~ resource "aws_iam_policy" "lambda_app_invoke" {
        id          = "arn:aws:iam::722713121070:policy/lambda_app_invoke"
        name        = "lambda_app_invoke"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ca-central-1:722713121070:function:Templates",
                          - "arn:aws:lambda:ca-central-1:722713121070:function:Submission",
                          - "arn:aws:lambda:ca-central-1:722713121070:function:Retrieval",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.organisations will be updated in-place
  ~ resource "aws_lambda_function" "organisations" {
        id                             = "Organisations"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:722713121070:layer:organisations_node_packages:6",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:722713121070:layer:reliability_lib_packages:1",
          - "arn:aws:lambda:ca-central-1:722713121070:layer:reliability_node_packages:6",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (25 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.retrieval will be updated in-place
  ~ resource "aws_lambda_function" "retrieval" {
        id                             = "Retrieval"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:722713121070:layer:retrieval_node_packages:6",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:722713121070:layer:submission_node_packages:6",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.templates will be updated in-place
  ~ resource "aws_lambda_function" "templates" {
        id                             = "Templates"
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:722713121070:layer:templates_node_packages:6",
        ] -> (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-scratch"
            "Terraform"  = "true"
        }
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.organisations_lib must be replaced
-/+ resource "aws_lambda_layer_version" "organisations_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:722713121070:layer:organisations_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-11-09T18:52:17.531+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:722713121070:layer:organisations_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:722713121070:layer:organisations_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "u/rnFs8hly4BBQPOTtVFdvdxcDcb60xVrP7vMyFYo4k=" -> "LJXoZ4/CtDEeZbVzNQX594g+onErSOp+rmhPhTRpDtE=" # forces replacement
      ~ source_code_size            = 1968644 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.reliability_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "reliability_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:722713121070:layer:reliability_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-11-09T18:52:07.190+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:722713121070:layer:reliability_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:722713121070:layer:reliability_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "L3lK+bGs30deHaG6MPTfhjAsP+u/Qhno2HRb/s/wTDE=" -> "DKIucyaARgKkUVQ5f4s1ZyuZ0MQx66+z9ZtqbTf33gA=" # forces replacement
      ~ source_code_size            = 4812649 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.retrieval_lib must be replaced
-/+ resource "aws_lambda_layer_version" "retrieval_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:722713121070:layer:retrieval_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-11-09T18:52:02.428+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:722713121070:layer:retrieval_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:722713121070:layer:retrieval_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "SmJkDbZUJhIDsPV4zaOiKGm1zoL0N0wwDnIRGz9qAZU=" -> "T5adV+haDOLZxPNGdpGALsnmoYZKYBrvVuOBKTbfp3o=" # forces replacement
      ~ source_code_size            = 2351749 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.submission_lib must be replaced
-/+ resource "aws_lambda_layer_version" "submission_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:722713121070:layer:submission_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-11-09T18:52:11.470+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:722713121070:layer:submission_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:722713121070:layer:submission_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Qo9KLlZPAnn6c14YhTfos3K7Zkfe2hkNnAEZlAhGn2c=" -> "LZCAV2cLcAPN9tdbQTeS13cX+2ROXn1x9dtcRXVLOy8=" # forces replacement
      ~ source_code_size            = 2485325 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.templates_lib must be replaced
-/+ resource "aws_lambda_layer_version" "templates_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:722713121070:layer:templates_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2021-11-09T18:52:15.686+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:722713121070:layer:templates_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:722713121070:layer:templates_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "VewQRqLkch/QiIQMYqjrs7WaJU9/NBrKzjUKSLwbn40=" -> "QAFbSfEcl0mIzHOpJmhNXZ0qgZHue5WO0B/XIXC+KvE=" # forces replacement
      ~ source_code_size            = 1967670 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.google_client_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "google_client_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_id-LWKRh1|49414442-353D-4532-AFAF-ED57B9B5874F" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "49414442-353D-4532-AFAF-ED57B9B5874F" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.google_client_secret must be replaced
-/+ resource "aws_secretsmanager_secret_version" "google_client_secret" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:722713121070:secret:google_client_secret-6sbruM|CA2DE94B-365D-48B0-B700-3CD3C4C92F09" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "CA2DE94B-365D-48B0-B700-3CD3C4C92F09" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 7 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
